app/views/posts/show.html.erb

<h2>Comments</h2>
<% @post.comments.where(comment_id: nil).each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`comment_id` IS NULL


  <% comment.comments.each do |i| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`comment_id` = 1